[
    {
        "title": "Persuasive/Deceptive Visualization",
        "year": "2025",
        "image": "/website.github.io/images/P:D viz.png",
        "description": "Visualized and debated oil dependence in Arab economies using comparative bar charts.",
        "tools": "HTML, CSS, Javascript, Tableau",
        "link": "https://ritazaarour.github.io/project2.github.io/"
    },
    {
        "title": "Flight Delay Analysis",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "A group project that analyzed flight delay patterns using PySpark on a large Kaggle dataset.",
        "tools": "Pyspark, Pandas, Matplotlib",
        "link": "https://github.com/SmoothData-BigBrain/GroupProject"
    },
    {
        "title": "How Much of My Closet is Thrifted?",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created a personal dataset to analyze my wardrobe composition and quantify how much of it was thrifted. Used Excel for tracking and data visualization to explore patterns across item categories and sources.",
        "tools": "Excel (Pivot Tables)",
        "link": "#"
    },
    {
        "title": "Fitness Data EDA",
        "year": "2024",
        "image": "/website.github.io/images/FDD.png",
        "description": "Explored trends using a fitness dataset, applying NumPy, Pandas, and Seaborn for EDA, and Scikit-learn for predictive modeling.",
        "tools": "Numpy, Pandas, Matplotlib, Seaborn, Scikit-learn (Logistic regression)",
        "link": "https://github.com/ritazaarour/DSC207R-PythonProjects-Fall2024/blob/main/Final_Project_Fall2024.ipynb"
    },
    {
        "title": "Global Happiness Score EDA",
        "year": "2024",
        "image": "/website.github.io/images/GHSA.png",
        "description": "Performed exploratory data analysis on world happiness data using NumPy, Pandas, and Seaborn. Visualized relationships between economy, life expectancy, freedom, and overall happiness scores across regions.",
        "tools":"Numpy, Pandas, Matplotlib, Seaborn",
        "link": "https://github.com/ritazaarour/DSC207R-PythonProjects-Fall2024/blob/main/mini_project.ipynb"
    },
    {
        "title": "Bikewatching - Geospatial Visualization",
        "year": "2025",
        "image": "/website.github.io/images/bikewatching.png",
        "description": "A fully interactive Mapbox and D3.js visualization that maps Boston’s Bluebikes network, showing station traffic volumes, directional flow patterns (arrivals vs. departures), and time-based activity using a dynamic slider and data filtering.",
        "tools":"HTML, CSS, Javascript, D3, Mapbox",
        "link": "https://ritazaarour.github.io/bikewatching.github.io/"
    },
    {
        "title": "Using CTL Induced Cytotoxicity to Analyze Caspase-3 Activity in Naïve and Pathogen Mice",
        "year": "2023",
        "image": "/website.github.io/images/immuno.png",
        "description": "Conducted an immunology experiment to measure Caspase-3 activity in naïve and pathogen-infected mice using a cytotoxic T lymphocyte (CTL) assay. Prepared and incubated target cells with effector CTLs to assess apoptosis via spectrophotometric absorbance. Compared Caspase-3 activity levels to evaluate immune response mechanisms and identify the pathogen type.",
        "tools": "ELISA, Flow Cytometry",
        "link": "#"
    },
    {
        "title": "Grocery Store Comparison Visualization Assignment",
        "year": "2025",
        "image": "/website.github.io/images/grocery.png",
        "description": "Created price comparison visualizations for grocery items across stores and categories.",
        "tools": "Tableau",
        "link": "https://drive.google.com/file/d/1JNVJpdAEjR0hBo-J-wKPtwmF7OCZbb4c/view?usp=sharing"
    },
    {
        "title": "TBA1",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Vitae pariatur facilis, reiciendis hic consequatur repellat magnam quaerat molestiae, officiis veniam quisquam doloremque perferendis natus illum voluptatum recusandae eaque quasi animi ratione nemo rerum odit fugiat. Porro, temporibus repellat?"
    },
    {
        "title": "TBA2",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Molestiae nisi voluptate quisquam vitae sapiente porro quibusdam deleniti excepturi facere pariatur sunt harum, eveniet, vero non voluptates ducimus quia! Iure rem dolor ratione repellendus, officia vitae delectus quaerat deserunt!"
    },
    {
        "title": "TBA3",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Repellendus ut neque magni tenetur cum, ad similique fugiat quo doloremque dolores corporis, dignissimos odit tempora. Voluptas nostrum voluptate, ipsum provident unde esse animi alias officia debitis omnis, incidunt dolore!"
    },
    {
        "title": "TBA4",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Rem illum corrupti ipsa vel nam culpa voluptas expedita rerum porro itaque deleniti at debitis nesciunt aliquam inventore, harum ratione ipsam, quidem, saepe esse veniam. Earum eius quos veniam sed."
    }
]